testLaminarFlatPlate/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         60;

deltaT          0.01;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    minMax
    {
        type            fieldMinMax;
        libs            ( fieldFunctionObjects );
        writeControl    timeStep;
        fields          ( U );
    }
    yPlus
    {
        type            yPlus;
        libs            ( fieldFunctionObjects );
        patches         ( fixedWall );
        writeControl    writeTime;
    }
    writeCellCentres
    {
        type            writeCellCentres;
        libs            ( fieldFunctionObjects );
        executeControl  writeTime;
        writeControl    writeTime;
    }
    wallShearStress
    {
        type            wallShearStress;
        libs            ( fieldFunctionObjects );
        executeControl  writeTime;
        writeControl    writeTime;
    }
}


// ************************************************************************* //
